Project/Toir/src/Reports/торо_ПланФактЗатрат/торо_ПланФактЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_ПланФактЗатрат</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ЗаявкиПоРемонтам/торо_ЗаявкиПоРемонтам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗаявкиПоРемонтам</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>IDРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УточнениеИсполнителя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.торо_РемонтныеБригады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОтмененныеЗаявки/торо_ОтмененныеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОтмененныеЗаявки</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.торо_ПричиныЗакрытияЗаявок</types>
    </type>
  </resources>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_НормативныеРемонтыОборудования/торо_НормативныеРемонтыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_НормативныеРемонтыОборудования</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтратегияОбслуживания</name>
    <type>
      <types>CatalogRef.торо_СтратегииОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>ИсточникСтратегии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТиповойОР</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РемонтныеЦиклыОборудования/торо_РемонтныеЦиклыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РемонтныеЦиклыОборудования</name>
  <resources>
    <name>НеУчитыватьПростоиОборудования</name>
    <comment>Использовать плановую наработка во время простоя (т.е. планировать ТО по наработке во время простоя)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидЦепочки</name>
    <type>
      <types>CatalogRef.торо_ЦепочкиРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаОбъектовРемонтов</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОР</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВерсииТехКарт</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_СоставИерархическихТехКартРемонтов/торо_СоставИерархическихТехКартРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СоставИерархическихТехКартРемонтов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТехКарта</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Состав</name>
    <type>
      <types>CatalogRef.торо_ТехКарты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РегламентныеМероприятияИСпискиОбъектов/торо_РегламентныеМероприятияИСпискиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РегламентныеМероприятияИСпискиОбъектов</name>
  <resources>
    <name>НормативныйРемонт</name>
    <type>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </resources>
  <resources>
    <name>СпособПланирования</name>
    <type>
      <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРемонтныхРабот</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>СпособУчетаДатыОтсчета</name>
    <type>
      <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
    </type>
  </resources>
  <resources>
    <name>НеУчаствуетВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
    <comment>Разрешить сокращать период между ремонтами в случае, если начало ремонта приходится на выходной день</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеУчитыватьПродолжительность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Продолжительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СпособРасчетаПродолжительности</name>
    <type>
      <types>EnumRef.торо_СпособыРасчетаПродолжительности</types>
    </type>
  </resources>
  <dimensions>
    <name>СписокОбъектов</name>
    <type>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМероприятия</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/AccumulationRegisters/торо_ПлановыеМатериальныеЗатратыРемонтныхРабот/торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ПлановыеМатериальныеЗатратыРемонтныхРабот</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РемонтыОборудования_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РемонтнаяРабота</name>
    <type>
      <types>CatalogRef.торо_ТехнологическиеОперации</types>
      <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Project/Toir/src/Reports/торо_ПланФактЗатрат/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИспользоватьОтборПоПериоду = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодВыполнения")).ИдентификаторПользовательскойНастройки).Использование;
	Если ИспользоватьОтборПоПериоду Тогда
		ПареметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
		ПареметрДатаНачала.Использование = Истина;
		ПараметрДатаОкончания = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
		ПараметрДатаОкончания.Использование = Истина;
	Иначе
		ПареметрДатаНачала = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
		ПареметрДатаНачала.Использование = Ложь;
		ПараметрДатаОкончания = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОкончания"));
		ПараметрДатаОкончания.Использование = Ложь;
	КонецЕсли;
	
		Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "ДатаОкончания", "НаборДанныхНоменклатура");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда

		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхНоменклатура.Запрос =
		ПолучитьСодержательнуюЧастьЗапросаНоменклатура()+
		"ВЫБРАТЬ
		|	СНулевымиЗначениями.Номенклатура КАК Номенклатура,
		|	СНулевымиЗначениями.РемонтыОборудования_IDНоменклатура КАК РемонтыОборудования_IDНоменклатура,
		|	СНулевымиЗначениями.ОбъектРемонтаНоменклатура КАК ОбъектРемонтаНоменклатура,
		|	СНулевымиЗначениями.ВидРемонтаНоменклатура КАК ВидРемонтаНоменклатура,
		|	СНулевымиЗначениями.ДокументПлана КАК ДокументПлана,
		|	СНулевымиЗначениями.ДатаНачалаПланНоменклатура КАК ДатаНачалаПланНоменклатура,
		|	СНулевымиЗначениями.ПлановоеКоличествоНоменклатура КАК ПлановоеКоличествоНоменклатура,
		|	СНулевымиЗначениями.ПлановаяЦенаНоменклатура КАК ПлановаяЦенаНоменклатура,
		|	СНулевымиЗначениями.ПлановаяСуммаНоменклатура КАК ПлановаяСуммаНоменклатура,
		|	СНулевымиЗначениями.ЕдиницаИзмеренияНоменклатура КАК ЕдиницаИзмеренияНоменклатура,
		|	СНулевымиЗначениями.ВидЗатратНоменклатура КАК ВидЗатратНоменклатура,
		|	СНулевымиЗначениями.ВидДокументаНоменклатура КАК ВидДокументаНоменклатура,
		|	СНулевымиЗначениями.ВалютаПлан КАК ВалютаПлан,
		|	СНулевымиЗначениями.Характеристика КАК Характеристика,
		|	СНулевымиЗначениями.ОбъектРемонтаНоменклатура." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	СНулевымиЗначениями КАК СНулевымиЗначениями";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);
		
		СхемаКомпоновкиДанных.НаборыДанных.НаборДанныхНоменклатура.Запрос = 
		ПолучитьСодержательнуюЧастьЗапросаНоменклатура()+
		"ВЫБРАТЬ
		|	СНулевымиЗначениями.Номенклатура КАК Номенклатура,
		|	СНулевымиЗначениями.РемонтыОборудования_IDНоменклатура КАК РемонтыОборудования_IDНоменклатура,
		|	СНулевымиЗначениями.ОбъектРемонтаНоменклатура КАК ОбъектРемонтаНоменклатура,
		|	СНулевымиЗначениями.ВидРемонтаНоменклатура КАК ВидРемонтаНоменклатура,
		|	СНулевымиЗначениями.ДокументПлана КАК ДокументПлана,
		|	СНулевымиЗначениями.ДатаНачалаПланНоменклатура КАК ДатаНачалаПланНоменклатура,
		|	СНулевымиЗначениями.ПлановоеКоличествоНоменклатура КАК ПлановоеКоличествоНоменклатура,
		|	СНулевымиЗначениями.ПлановаяЦенаНоменклатура КАК ПлановаяЦенаНоменклатура,
		|	СНулевымиЗначениями.ПлановаяСуммаНоменклатура КАК ПлановаяСуммаНоменклатура,
		|	СНулевымиЗначениями.ЕдиницаИзмеренияНоменклатура КАК ЕдиницаИзмеренияНоменклатура,
		|	СНулевымиЗначениями.ВидЗатратНоменклатура КАК ВидЗатратНоменклатура,
		|	СНулевымиЗначениями.ВидДокументаНоменклатура КАК ВидДокументаНоменклатура,
		|	СНулевымиЗначениями.ВалютаПлан КАК ВалютаПлан,
		|	СНулевымиЗначениями.Характеристика КАК Характеристика,
		|	СНулевымиЗначениями.ОбъектРемонтаНоменклатура КАК ОбъектИерархии
		|ИЗ
		|	СНулевымиЗначениями КАК СНулевымиЗначениями";
		
	КонецЕсли;
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	дс_ДобавитьПараметрыВСКД();
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ФункцииОтчетовКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриЗагрузкеПользовательскихНастроекНаСервере = Истина;
	Настройки.События.ПриЗагрузкеВариантаНаСервере = Истина;
	Настройки.События.ПослеЗаполненияПанелиБыстрыхНастроек = Истина;
	Настройки.События.ПередЗагрузкойНастроекВКомпоновщик = Истина;
	
КонецПроцедуры

Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт

	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПриЗагрузкеВариантаНаСервере(Форма, НовыеПользовательскиеНастройкиКД) Экспорт
	
	ПользовательскиеНастройкиЭлементы = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;	
	ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы);
	
КонецПроцедуры

Процедура ПрименитьФункциональныеОпцииКНастройкам(ПользовательскиеНастройкиЭлементы)
	
	Для каждого Элемент Из ПользовательскиеНастройкиЭлементы Цикл
		Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
			Если (Строка(Элемент.Параметр) = "УчитыватьПланГрафикиППР"
				И Не ПолучитьЗначениеФО("торо_ИспользоватьППР"))Тогда
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьРегламентныеМероприятия"
				И Не ПолучитьЗначениеФО("торо_ИспользоватьРегламентныеМероприятия")) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоДефектам"
				И (Не ПолучитьЗначениеФО("торо_УчетВыявленныхДефектовОборудования")
				ИЛИ Не ПолучитьЗначениеФО("торо_ИспользоватьСметыРемонта")) ) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь;
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				Продолжить;
			ИначеЕсли (Строка(Элемент.Параметр) = "УчитыватьСметыПоВнешнимОснованиям"
				И (Не ПолучитьЗначениеФО("торо_ИспользоватьВнешниеОснованияДляРабот")
				ИЛИ Не ПолучитьЗначениеФО("торо_ИспользоватьСметыРемонта")) ) Тогда 
				Элемент.Значение      = Ложь;
				Элемент.Использование = Ложь; 
				Элемент.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПослеЗаполненияПанелиБыстрыхНастроек(Форма, ПараметрыЗаполнения) Экспорт
	
	Если Найти(Форма.ИмяФормы,"НастройкиОтчета") > 0  Тогда
		
		ЭлементыФормы = Форма.Элементы;
		ЭлементГруппаГлавное = ЭлементыФормы.Найти("ОбычныеОтборы");
		Если Не ЭлементГруппаГлавное = Неопределено Тогда
			ЭлементГруппаГлавное.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		КонецЕсли; 
		
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьЗначениеФО(ТекущаяОпция) Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию(ТекущаяОпция);
	
КонецФункции

Процедура ПередЗагрузкойНастроекВКомпоновщик(Результат, КлючСхемы, КлючВарианта, НастройкиКД, ПользовательскиеНастройкиКД) Экспорт
	
	Если НастройкиКД = Неопределено Тогда Возврат; КонецЕсли;
	Если ПользовательскиеНастройкиКД = Неопределено Тогда Возврат; КонецЕсли;
	
	Элем = НастройкиКД.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидДокумента")).ИдентификаторПользовательскойНастройки;
	НайЭл = ПользовательскиеНастройкиКД.Элементы.Найти(элем);
	Если НайЭл = Неопределено Тогда Возврат; КонецЕсли; 
	
	нИспользование = НайЭл.Использование; 
	нВидДокумента = ?(нИспользование, ПользовательскиеНастройкиКД.Элементы.Найти(элем).Значение, Ложь);
	
	Для каждого текНастройка из НастройкиКД.Структура Цикл
		Если ТипЗнч(текНастройка) = Тип("ТаблицаКомпоновкиДанных") Тогда
			Для каждого ТекКолонка из текНастройка.Колонки Цикл
				Если ТекКолонка.имя = "ВидДокумента" Тогда
					ТекКолонка.Использование = нВидДокумента;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСодержательнуюЧастьЗапросаНоменклатура()

	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_Ремонты.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_Ремонты.ВидРемонта КАК ВидРемонта,
	|	торо_Ремонты.ID КАК ID,
	|	торо_ПланГрафикРемонта.Ссылка КАК ДокументВводаРемонта,
	|	торо_Ремонты.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	""План-график ремонта"" КАК ВидДокумента,
	|	торо_ПланГрафикРемонта.Ссылка КАК ДокументПлана,
	|	торо_Ремонты.Период КАК Период
	|ПОМЕСТИТЬ торо_РемонтыПланВсе
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК торо_ПланГрафикРемонта
	|		ПО торо_Ремонты.Регистратор = торо_ПланГрафикРемонта.Ссылка
	|			И торо_Ремонты.ID = торо_ПланГрафикРемонта.ID
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК РегистрЗаявки
	|		ПО торо_Ремонты.ID = РегистрЗаявки.IDРемонта
	|			И (НЕ РегистрЗаявки.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки))
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетПланГрафиковППР
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И РегистрЗаявки.IDРемонта ЕСТЬ NULL
	|{ГДЕ
	|	(торо_Ремонты.ДатаНачалаПлан >= &ДатаНачала),
	|	(торо_Ремонты.ДатаНачалаПлан <= &ДатаОкончания)}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыВД.ОбъектРемонта,
	|	РемонтЗаявка.ВидРемонта,
	|	РемонтыВД.ID,
	|	торо_ВыявленныеДефекты.Ссылка,
	|	РемонтЗаявка.ДатаНачалаПлан,
	|	""Выявленные дефекты"",
	|	торо_ЗаявкаНаРемонт.Ссылка,
	|	РемонтыВД.Период
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК РемонтыВД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК РемонтЗаявка
	|		ПО РемонтыВД.ID = РемонтЗаявка.ID
	|			И (РемонтЗаявка.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
	|			И (РемонтыВД.Регистратор ССЫЛКА Документ.торо_ВыявленныеДефекты)
	|			И (НЕ РемонтЗаявка.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|		ПО (РемонтЗаявка.Регистратор = торо_ЗаявкаНаРемонт.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВыявленныеДефекты КАК торо_ВыявленныеДефекты
	|		ПО РемонтыВД.Регистратор = торо_ВыявленныеДефекты.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетСметПоДефектам
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|{ГДЕ
	|	(РемонтЗаявка.ДатаНачалаПлан >= &ДатаНачала),
	|	(РемонтЗаявка.ДатаНачалаПлан <= &ДатаОкончания)}
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыВД.ОбъектРемонта,
	|	РемонтЗаявка.ВидРемонта,
	|	РемонтыВД.ID,
	|	торо_ВнешнееОснованиеДляРабот.Ссылка,
	|	РемонтЗаявка.ДатаНачалаПлан,
	|	""Внешние основания"",
	|	торо_ЗаявкаНаРемонт.Ссылка,
	|	РемонтыВД.Период
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК РемонтыВД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК РемонтЗаявка
	|		ПО РемонтыВД.ID = РемонтЗаявка.ID
	|			И (РемонтЗаявка.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
	|			И (РемонтыВД.Регистратор ССЫЛКА Документ.торо_ВнешнееОснованиеДляРабот)
	|			И (НЕ РемонтЗаявка.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВнешнееОснованиеДляРабот КАК торо_ВнешнееОснованиеДляРабот
	|		ПО РемонтыВД.Регистратор = торо_ВнешнееОснованиеДляРабот.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|		ПО (РемонтЗаявка.Регистратор = торо_ЗаявкаНаРемонт.Ссылка)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетСметПоВнешнимОснованиям
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|{ГДЕ
	|	(РемонтЗаявка.ДатаНачалаПлан >= &ДатаНачала),
	|	(РемонтЗаявка.ДатаНачалаПлан <= &ДатаОкончания) }
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РемонтыППР.ОбъектРемонта,
	|	РемонтЗаявка.ВидРемонта,
	|	РемонтыППР.ID,
	|	торо_ПланГрафикРемонта.Ссылка,
	|	РемонтЗаявка.ДатаНачалаПлан,
	|	""План-график ремонта"",
	|	торо_ЗаявкаНаРемонт.Ссылка,
	|	РемонтыППР.Период
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК РемонтыППР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_Ремонты КАК РемонтЗаявка
	|		ПО РемонтыППР.ID = РемонтЗаявка.ID
	|			И (РемонтЗаявка.Регистратор ССЫЛКА Документ.торо_ЗаявкаНаРемонт)
	|			И (РемонтыППР.Регистратор ССЫЛКА Документ.торо_ПланГрафикРемонта)
	|			И (НЕ РемонтЗаявка.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт КАК торо_ЗаявкаНаРемонт
	|		ПО (РемонтЗаявка.Регистратор = торо_ЗаявкаНаРемонт.Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта КАК торо_ПланГрафикРемонта
	|		ПО РемонтыППР.Регистратор = торо_ПланГрафикРемонта.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетПланГрафиковППР
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|{ГДЕ
	|	(РемонтЗаявка.ДатаНачалаПлан >= &ДатаНачала),
	|	(РемонтЗаявка.ДатаНачалаПлан <= &ДатаОкончания) }
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_Ремонты.ОбъектРемонта,
	|	торо_Ремонты.ВидРемонта,
	|	торо_Ремонты.ID,
	|	торо_ГрафикРегламентныхМероприятийТОиР.Ссылка,
	|	торо_Ремонты.ДатаНачалаПлан,
	|	""Регламентные мероприятия"",
	|	торо_ГрафикРегламентныхМероприятийТОиР.Ссылка,
	|	торо_Ремонты.Период
	|ИЗ
	|	РегистрСведений.торо_Ремонты КАК торо_Ремонты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР КАК торо_ГрафикРегламентныхМероприятийТОиР
	|		ПО торо_Ремонты.Регистратор = торо_ГрафикРегламентныхМероприятийТОиР.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &РассчетРеглМероприятий
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|{ГДЕ
	|	(торо_Ремонты.ДатаНачалаПлан >= &ДатаНачала),
	|	(торо_Ремонты.ДатаНачалаПлан <= &ДатаОкончания)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	ОбъектРемонта,
	|	ВидРемонта,
	|	ДокументПлана
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_РемонтыПланВсе.ID КАК ID,
	|	МАКСИМУМ(торо_РемонтыПланВсе.Период) КАК Период,
	|	торо_РемонтыПланВсе.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПланВсе.ВидДокумента КАК ВидДокумента
	|ПОМЕСТИТЬ торо_РемонтыПланОтбор
	|ИЗ
	|	торо_РемонтыПланВсе КАК торо_РемонтыПланВсе
	|ГДЕ
	|	НЕ торо_РемонтыПланВсе.ДокументПлана ССЫЛКА Документ.торо_ПланГрафикРемонта
	|	И НЕ торо_РемонтыПланВсе.ДокументПлана ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_РемонтыПланВсе.ID,
	|	торо_РемонтыПланВсе.ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта,
	|	торо_РемонтыПланВсе.ВидДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_РемонтыПланВсе.ID КАК ID,
	|	МАКСИМУМ(торо_РемонтыПланВсе.Период) КАК Период,
	|	торо_РемонтыПланВсе.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПланВсе.ВидДокумента КАК ВидДокумента
	|ПОМЕСТИТЬ торо_РемонтыПланОтборППР
	|ИЗ
	|	торо_РемонтыПланВсе КАК торо_РемонтыПланВсе
	|ГДЕ
	|	торо_РемонтыПланВсе.ДокументПлана ССЫЛКА Документ.торо_ПланГрафикРемонта
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_РемонтыПланВсе.ID,
	|	торо_РемонтыПланВсе.ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта,
	|	торо_РемонтыПланВсе.ВидДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_РемонтыПланВсе.ID КАК ID,
	|	МАКСИМУМ(торо_РемонтыПланВсе.Период) КАК Период,
	|	торо_РемонтыПланВсе.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПланВсе.ВидДокумента КАК ВидДокумента
	|ПОМЕСТИТЬ торо_РемонтыПланОтборРМ
	|ИЗ
	|	торо_РемонтыПланВсе КАК торо_РемонтыПланВсе
	|ГДЕ
	|	торо_РемонтыПланВсе.ДокументПлана ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_РемонтыПланВсе.ID,
	|	торо_РемонтыПланВсе.ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта,
	|	торо_РемонтыПланВсе.ВидДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтыПланВсе.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПланВсе.ID КАК ID,
	|	торо_РемонтыПланВсе.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	торо_РемонтыПланВсе.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	торо_РемонтыПланВсе.ВидДокумента КАК ВидДокумента,
	|	торо_РемонтыПланВсе.ДокументПлана КАК ДокументПлана
	|ПОМЕСТИТЬ торо_РемонтыПлан
	|ИЗ
	|	торо_РемонтыПланВсе КАК торо_РемонтыПланВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ торо_РемонтыПланОтбор КАК торо_РемонтыПланОтбор
	|		ПО торо_РемонтыПланВсе.ID = торо_РемонтыПланОтбор.ID
	|			И торо_РемонтыПланВсе.Период = торо_РемонтыПланОтбор.Период
	|			И торо_РемонтыПланВсе.ОбъектРемонта = торо_РемонтыПланОтбор.ОбъектРемонта
	|			И торо_РемонтыПланВсе.ВидРемонта = торо_РемонтыПланОтбор.ВидРемонта
	|			И торо_РемонтыПланВсе.ВидДокумента = торо_РемонтыПланОтбор.ВидДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РемонтыПланВсе.ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта,
	|	торо_РемонтыПланВсе.ID,
	|	торо_РемонтыПланВсе.ДокументВводаРемонта,
	|	торо_РемонтыПланВсе.ДатаНачалаПлан,
	|	торо_РемонтыПланВсе.ВидДокумента,
	|	торо_РемонтыПланВсе.ДокументПлана
	|ИЗ
	|	торо_РемонтыПланВсе КАК торо_РемонтыПланВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ торо_РемонтыПланОтборППР КАК торо_РемонтыПланОтборППР
	|		ПО торо_РемонтыПланВсе.ID = торо_РемонтыПланОтборППР.ID
	|			И торо_РемонтыПланВсе.Период = торо_РемонтыПланОтборППР.Период
	|			И торо_РемонтыПланВсе.ОбъектРемонта = торо_РемонтыПланОтборППР.ОбъектРемонта
	|			И торо_РемонтыПланВсе.ВидРемонта = торо_РемонтыПланОтборППР.ВидРемонта
	|			И торо_РемонтыПланВсе.ВидДокумента = торо_РемонтыПланОтборППР.ВидДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ПланГрафикРемонта.ПланРемонтов КАК ПланРемонтов
	|		ПО торо_РемонтыПланВсе.ID = ПланРемонтов.ID
	|			И торо_РемонтыПланВсе.ДокументПлана = ПланРемонтов.Ссылка
	|			И (НЕ ПланРемонтов.Отменен)
	|			И (НЕ ПланРемонтов.Замещен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_РемонтыПланВсе.ОбъектРемонта,
	|	торо_РемонтыПланВсе.ВидРемонта,
	|	торо_РемонтыПланВсе.ID,
	|	торо_РемонтыПланВсе.ДокументВводаРемонта,
	|	торо_РемонтыПланВсе.ДатаНачалаПлан,
	|	торо_РемонтыПланВсе.ВидДокумента,
	|	торо_РемонтыПланВсе.ДокументПлана
	|ИЗ
	|	торо_РемонтыПланВсе КАК торо_РемонтыПланВсе
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ торо_РемонтыПланОтборРМ КАК торо_РемонтыПланОтборРМ
	|		ПО торо_РемонтыПланВсе.ID = торо_РемонтыПланОтборРМ.ID
	|			И торо_РемонтыПланВсе.Период = торо_РемонтыПланОтборРМ.Период
	|			И торо_РемонтыПланВсе.ОбъектРемонта = торо_РемонтыПланОтборРМ.ОбъектРемонта
	|			И торо_РемонтыПланВсе.ВидРемонта = торо_РемонтыПланОтборРМ.ВидРемонта
	|			И торо_РемонтыПланВсе.ВидДокумента = торо_РемонтыПланОтборРМ.ВидДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ГрафикРегламентныхМероприятийТОиР.ПланРемонтов КАК ПланРемонтов
	|		ПО торо_РемонтыПланВсе.ID = ПланРемонтов.ID
	|			И торо_РемонтыПланВсе.ДокументПлана = ПланРемонтов.Ссылка
	|			И (НЕ ПланРемонтов.Отменен)
	|			И (НЕ ПланРемонтов.Замещен)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтыПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПлан.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПлан.ID КАК ID,
	|	торо_РемонтыПлан.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	торо_РемонтыПлан.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	торо_РемонтыПлан.ВидДокумента КАК ВидДокумента,
	|	торо_РемонтыПлан.ДокументПлана КАК ДокументПлана
	|ПОМЕСТИТЬ РемонтыБезЗаявок
	|ИЗ
	|	торо_РемонтыПлан КАК торо_РемонтыПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗаявкиПоРемонтам КАК торо_ЗаявкиПоРемонтам
	|		ПО торо_РемонтыПлан.ID = торо_ЗаявкиПоРемонтам.IDРемонта
	|			И (торо_ЗаявкиПоРемонтам.Отменен ЕСТЬ NULL)
	|			И (НЕ торо_ЗаявкиПоРемонтам.Регистратор В
	|					(ВЫБРАТЬ
	|						торо_ОтмененныеЗаявки.Заявка
	|					ИЗ
	|						РегистрСведений.торо_ОтмененныеЗаявки КАК торо_ОтмененныеЗаявки))
	|ГДЕ
	|	торо_ЗаявкиПоРемонтам.IDРемонта ЕСТЬ NULL
	|	И НЕ торо_РемонтыПлан.ДокументВводаРемонта ССЫЛКА Документ.торо_ГрафикРегламентныхМероприятийТОиР
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта,
	|	ВидРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_НормативныеРемонтыОборудования.НормативныйРемонт КАК НормативныйРемонт,
	|	РемонтыБезЗаявок.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыБезЗаявок.ВидРемонта КАК ВидРемонта,
	|	РемонтыБезЗаявок.ID КАК ID,
	|	РемонтыБезЗаявок.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	РемонтыБезЗаявок.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	РемонтыБезЗаявок.ВидДокумента КАК ВидДокумента,
	|	РемонтыБезЗаявок.ДокументПлана КАК ДокументПлана
	|ПОМЕСТИТЬ ТкПоНормРемонтамБезЗаявок
	|ИЗ
	|	РемонтыБезЗаявок КАК РемонтыБезЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормативныеРемонтыОборудования КАК торо_НормативныеРемонтыОборудования
	|		ПО РемонтыБезЗаявок.ВидРемонта = торо_НормативныеРемонтыОборудования.ВидРемонта
	|			И (ВЫБОР
	|				КОГДА торо_НормативныеРемонтыОборудования.Приоритет
	|					ТОГДА РемонтыБезЗаявок.ОбъектРемонта = торо_НормативныеРемонтыОборудования.ОбъектРемонта
	|				ИНАЧЕ РемонтыБезЗаявок.ОбъектРемонта = торо_НормативныеРемонтыОборудования.ТиповойОР
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	торо_ЦепочкиРемонтаПоследовательностьРемонтов.НормативныйРемонт,
	|	РемонтыБезЗаявок.ОбъектРемонта,
	|	РемонтыБезЗаявок.ВидРемонта,
	|	РемонтыБезЗаявок.ID,
	|	РемонтыБезЗаявок.ДокументВводаРемонта,
	|	РемонтыБезЗаявок.ДатаНачалаПлан,
	|	РемонтыБезЗаявок.ВидДокумента,
	|	РемонтыБезЗаявок.ДокументПлана
	|ИЗ
	|	РемонтыБезЗаявок КАК РемонтыБезЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_РемонтныеЦиклыОборудования КАК торо_РемонтныеЦиклыОборудования
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.торо_ЦепочкиРемонта.ПоследовательностьРемонтов КАК торо_ЦепочкиРемонтаПоследовательностьРемонтов
	|			ПО торо_РемонтныеЦиклыОборудования.ВидЦепочки = торо_ЦепочкиРемонтаПоследовательностьРемонтов.Ссылка
	|		ПО РемонтыБезЗаявок.ОбъектРемонта = торо_РемонтныеЦиклыОборудования.ГруппаОбъектовРемонтов
	|			И (РемонтыБезЗаявок.ВидРемонта = торо_ЦепочкиРемонтаПоследовательностьРемонтов.ВидРемонта)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	НормативныйРемонт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(торо_ВерсииТехКарт.Период) КАК Период,
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	|	ТкПоНормРемонтамБезЗаявок.ОбъектРемонта КАК ОбъектРемонта,
	|	ТкПоНормРемонтамБезЗаявок.ВидРемонта КАК ВидРемонта,
	|	ТкПоНормРемонтамБезЗаявок.ID КАК ID,
	|	ТкПоНормРемонтамБезЗаявок.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	ТкПоНормРемонтамБезЗаявок.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	ТкПоНормРемонтамБезЗаявок.ВидДокумента КАК ВидДокумента,
	|	ТкПоНормРемонтамБезЗаявок.ДокументПлана КАК ДокументПлана
	|ПОМЕСТИТЬ ТкПоДатуРемонта
	|ИЗ
	|	ТкПоНормРемонтамБезЗаявок КАК ТкПоНормРемонтамБезЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО ТкПоНормРемонтамБезЗаявок.НормативныйРемонт = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|			И ТкПоНормРемонтамБезЗаявок.ДатаНачалаПлан >= торо_ВерсииТехКарт.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты,
	|	ТкПоНормРемонтамБезЗаявок.ОбъектРемонта,
	|	ТкПоНормРемонтамБезЗаявок.ВидРемонта,
	|	ТкПоНормРемонтамБезЗаявок.ID,
	|	ТкПоНормРемонтамБезЗаявок.ДокументВводаРемонта,
	|	ТкПоНормРемонтамБезЗаявок.ДатаНачалаПлан,
	|	ТкПоНормРемонтамБезЗаявок.ВидДокумента,
	|	ТкПоНормРемонтамБезЗаявок.ДокументПлана
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторТехКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВерсииТехКарт.ТехКарта КАК ТехКарта,
	|	ТкПоДатуРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	ТкПоДатуРемонта.ВидРемонта КАК ВидРемонта,
	|	ТкПоДатуРемонта.ID КАК ID,
	|	ТкПоДатуРемонта.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	ТкПоДатуРемонта.ДокументПлана КАК ДокументПлана
	|ПОМЕСТИТЬ ТкНаДатуРемонта
	|ИЗ
	|	ТкПоДатуРемонта КАК ТкПоДатуРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО ТкПоДатуРемонта.ИдентификаторТехКарты = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|			И ТкПоДатуРемонта.Период = торо_ВерсииТехКарт.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты,
	|	торо_ВерсииТехКарт.ТехКарта,
	|	ТкПоДатуРемонта.ОбъектРемонта,
	|	ТкПоДатуРемонта.ВидРемонта,
	|	ТкПоДатуРемонта.ID,
	|	ТкПоДатуРемонта.ДокументВводаРемонта,
	|	ТкПоДатуРемонта.ДокументПлана
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТкНаДатуРемонта.ID КАК ID,
	|	ТкНаДатуРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	ТкНаДатуРемонта.ВидРемонта КАК ВидРемонта,
	|	ТкНаДатуРемонта.ТехКарта КАК НормативныйРемонт,
	|	торо_Состав.Состав КАК ТехКарта,
	|	торо_Состав.Количество КАК Количество,
	|	ТкНаДатуРемонта.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	ТкНаДатуРемонта.ДокументПлана КАК ДокументПлана
	|ПОМЕСТИТЬ ТкСостав
	|ИЗ
	|	ТкНаДатуРемонта КАК ТкНаДатуРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_Состав
	|		ПО ТкНаДатуРемонта.ТехКарта = торо_Состав.ТехКарта
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТкНаДатуРемонта.ID,
	|	ТкНаДатуРемонта.ОбъектРемонта,
	|	ТкНаДатуРемонта.ВидРемонта,
	|	ТкНаДатуРемонта.ТехКарта,
	|	ТкНаДатуРемонта.ТехКарта,
	|	1,
	|	ТкНаДатуРемонта.ДокументВводаРемонта,
	|	ТкНаДатуРемонта.ДокументПлана
	|ИЗ
	|	ТкНаДатуРемонта КАК ТкНаДатуРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_РемонтыПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	МАКСИМУМ(торо_ВерсииТехКарт.Период) КАК Период,
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты КАК ИдентификаторТехКарты,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.НормативныйРемонт КАК НормативныйРемонт,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.ГрафикРемонтныхРабот КАК ГрафикРемонтныхРабот,
	|	торо_РемонтыПлан.ДатаНачалаПлан КАК ДатаРемонта,
	|	торо_РемонтыПлан.ВидРемонта КАК ВидРемонтныхРабот,
	|	торо_РемонтыПлан.ID КАК ID,
	|	торо_РемонтыПлан.ДокументВводаРемонта КАК ДокументВводаРемонта
	|ПОМЕСТИТЬ РемонтыМероприятий
	|ИЗ
	|	торо_РемонтыПлан КАК торо_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_РегламентныеМероприятияИСпискиОбъектов КАК торо_РегламентныеМероприятияИСпискиОбъектов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|			ПО торо_РегламентныеМероприятияИСпискиОбъектов.НормативныйРемонт = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|		ПО торо_РемонтыПлан.ОбъектРемонта = торо_РегламентныеМероприятияИСпискиОбъектов.СписокОбъектов
	|			И торо_РемонтыПлан.ВидРемонта = торо_РегламентныеМероприятияИСпискиОбъектов.ВидМероприятия
	|			И (торо_РемонтыПлан.ДатаНачалаПлан >= торо_ВерсииТехКарт.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_РемонтыПлан.ОбъектРемонта,
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.НормативныйРемонт,
	|	торо_РегламентныеМероприятияИСпискиОбъектов.ГрафикРемонтныхРабот,
	|	торо_РемонтыПлан.ДатаНачалаПлан,
	|	торо_РемонтыПлан.ВидРемонта,
	|	торо_РемонтыПлан.ID,
	|	торо_РемонтыПлан.ДокументВводаРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторТехКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_ВерсииТехКарт.ТехКарта КАК ТехКарта,
	|	РемонтыМероприятий.ОбъектРемонта КАК ОбъектРемонта,
	|	РемонтыМероприятий.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	РемонтыМероприятий.ID КАК ID,
	|	РемонтыМероприятий.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	РемонтыМероприятий.ДатаРемонта КАК ДатаРемонта
	|ПОМЕСТИТЬ ТкРемонтовНаДатуРемонта
	|ИЗ
	|	РемонтыМероприятий КАК РемонтыМероприятий
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ВерсииТехКарт КАК торо_ВерсииТехКарт
	|		ПО РемонтыМероприятий.ИдентификаторТехКарты = торо_ВерсииТехКарт.ИдентификаторТехКарты
	|			И РемонтыМероприятий.Период = торо_ВерсииТехКарт.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ВерсииТехКарт.ИдентификаторТехКарты,
	|	торо_ВерсииТехКарт.ТехКарта,
	|	РемонтыМероприятий.ОбъектРемонта,
	|	РемонтыМероприятий.ВидРемонтныхРабот,
	|	РемонтыМероприятий.ID,
	|	РемонтыМероприятий.ДокументВводаРемонта,
	|	РемонтыМероприятий.ДатаРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТкРемонтовНаДатуРемонта.ДатаРемонта КАК ДатаРемонта,
	|	ТкРемонтовНаДатуРемонта.ОбъектРемонта КАК ОбъектРемонта,
	|	ТкРемонтовНаДатуРемонта.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_СоставИерархическихТехКартРемонтов.Состав КАК ТехКарта,
	|	торо_СоставИерархическихТехКартРемонтов.Количество КАК Количество,
	|	ТкРемонтовНаДатуРемонта.ID КАК ID,
	|	ТкРемонтовНаДатуРемонта.ДокументВводаРемонта КАК ДокументВводаРемонта
	|ПОМЕСТИТЬ РемонтыМероприятийсКоличеством
	|ИЗ
	|	ТкРемонтовНаДатуРемонта КАК ТкРемонтовНаДатуРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_СоставИерархическихТехКартРемонтов КАК торо_СоставИерархическихТехКартРемонтов
	|		ПО ТкРемонтовНаДатуРемонта.ТехКарта = торо_СоставИерархическихТехКартРемонтов.ТехКарта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТкРемонтовНаДатуРемонта.ДатаРемонта,
	|	ТкРемонтовНаДатуРемонта.ОбъектРемонта,
	|	ТкРемонтовНаДатуРемонта.ВидРемонтныхРабот,
	|	ТкРемонтовНаДатуРемонта.ТехКарта,
	|	1,
	|	ТкРемонтовНаДатуРемонта.ID,
	|	ТкРемонтовНаДатуРемонта.ДокументВводаРемонта
	|ИЗ
	|	ТкРемонтовНаДатуРемонта КАК ТкРемонтовНаДатуРемонта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ТехКарта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	10 КАК Приоритет,
	|	торо_РемонтыПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПлан.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПлан.ID КАК ID,
	|	торо_РемонтыПлан.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура КАК Номенклатура,
	|	СУММА(торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Количество) КАК КоличествоПлан,
	|	торо_РемонтыПлан.ДокументПлана КАК ДокументПлана,
	|	""Материальные затраты"" КАК ВидЗатрат,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры КАК Характеристика
	|ПОМЕСТИТЬ ПлановыеЗатратыНоменклатура
	|ИЗ
	|	торо_РемонтыПлан КАК торо_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеМатериальныеЗатратыРемонтныхРабот КАК торо_ПлановыеМатериальныеЗатратыРемонтныхРабот
	|		ПО торо_РемонтыПлан.ID = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|			И торо_РемонтыПлан.ДокументПлана = торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_РемонтыПлан.ОбъектРемонта,
	|	торо_РемонтыПлан.ВидРемонта,
	|	торо_РемонтыПлан.ID,
	|	торо_РемонтыПлан.ДокументВводаРемонта,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.Номенклатура,
	|	торо_РемонтыПлан.ДокументПлана,
	|	торо_ПлановыеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ТкСостав.ОбъектРемонта,
	|	ТкСостав.ВидРемонта,
	|	ТкСостав.ID,
	|	ТкСостав.ДокументВводаРемонта,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура,
	|	СУММА(торо_ТехКартыМатериальныеЗатраты.Количество * ТкСостав.Количество),
	|	ТкСостав.ДокументПлана,
	|	""Материальные затраты"",
	|	торо_ТехКартыМатериальныеЗатраты.Характеристика
	|ИЗ
	|	ТкСостав КАК ТкСостав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	|		ПО ТкСостав.ТехКарта = торо_ТехКартыМатериальныеЗатраты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура,
	|	ТкСостав.ДокументПлана,
	|	ТкСостав.ДокументВводаРемонта,
	|	ТкСостав.ID,
	|	ТкСостав.ВидРемонта,
	|	ТкСостав.ОбъектРемонта,
	|	торо_ТехКартыМатериальныеЗатраты.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	10 КАК Приоритет,
	|	торо_РемонтыПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПлан.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПлан.ID КАК ID,
	|	торо_РемонтыПлан.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура КАК Номенклатура,
	|	СУММА(торо_ПлановыеЗатратыЗапчастей.Количество) КАК КоличествоПлан,
	|	торо_РемонтыПлан.ДокументПлана КАК ДокументПлана,
	|	""Затраты запчастей"" КАК ВидЗатрат,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры КАК Характеристика
	|ПОМЕСТИТЬ ПлановыеЗатратыЗапчастей
	|ИЗ
	|	торо_РемонтыПлан КАК торо_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ПлановыеЗатратыЗапчастей КАК торо_ПлановыеЗатратыЗапчастей
	|		ПО торо_РемонтыПлан.ID = торо_ПлановыеЗатратыЗапчастей.РемонтыОборудования_ID
	|			И торо_РемонтыПлан.ДокументПлана = торо_ПлановыеЗатратыЗапчастей.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_РемонтыПлан.ОбъектРемонта,
	|	торо_РемонтыПлан.ВидРемонта,
	|	торо_РемонтыПлан.ID,
	|	торо_РемонтыПлан.ДокументВводаРемонта,
	|	торо_ПлановыеЗатратыЗапчастей.Номенклатура,
	|	торо_РемонтыПлан.ДокументПлана,
	|	торо_ПлановыеЗатратыЗапчастей.ХарактеристикаНоменклатуры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	РемонтыБезЗаявок.ОбъектРемонта,
	|	РемонтыБезЗаявок.ВидРемонта,
	|	РемонтыБезЗаявок.ID,
	|	РемонтыБезЗаявок.ДокументВводаРемонта,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	|	СУММА(торо_НормыЗапчастейНаОбъектыРемонта.Количество),
	|	РемонтыБезЗаявок.ДокументПлана,
	|	""Затраты запчастей"",
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика
	|ИЗ
	|	РемонтыБезЗаявок КАК РемонтыБезЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НормыЗапчастейНаОбъектыРемонта КАК торо_НормыЗапчастейНаОбъектыРемонта
	|		ПО РемонтыБезЗаявок.ВидРемонта = торо_НормыЗапчастейНаОбъектыРемонта.ВидРемонта
	|			И (ВЫБОР
	|				КОГДА торо_НормыЗапчастейНаОбъектыРемонта.Приоритет
	|					ТОГДА РемонтыБезЗаявок.ОбъектРемонта = торо_НормыЗапчастейНаОбъектыРемонта.ОбъектРемонта
	|				ИНАЧЕ РемонтыБезЗаявок.ОбъектРемонта = торо_НормыЗапчастейНаОбъектыРемонта.ТиповойОР
	|			КОНЕЦ)
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_НормыЗапчастейНаОбъектыРемонта.Номенклатура,
	|	РемонтыБезЗаявок.ОбъектРемонта,
	|	РемонтыБезЗаявок.ВидРемонта,
	|	РемонтыБезЗаявок.ID,
	|	РемонтыБезЗаявок.ДокументВводаРемонта,
	|	РемонтыБезЗаявок.ДокументПлана,
	|	торо_НормыЗапчастейНаОбъектыРемонта.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПЗН.ID КАК ID,
	|	МАКСИМУМ(ПЗН.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ПланЗатратыНом_Приоритет
	|ИЗ
	|	ПлановыеЗатратыНоменклатура КАК ПЗН
	|
	|СГРУППИРОВАТЬ ПО
	|	ПЗН.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПЗЗ.ID КАК ID,
	|	МАКСИМУМ(ПЗЗ.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ПланЗатратыЗапчастей_Приоритет
	|ИЗ
	|	ПлановыеЗатратыЗапчастей КАК ПЗЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПЗЗ.ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПлановыеЗатратыНоменклатура.ОбъектРемонта КАК ОбъектРемонта,
	|	ПлановыеЗатратыНоменклатура.ВидРемонта КАК ВидРемонта,
	|	ПлановыеЗатратыНоменклатура.ID КАК ID,
	|	ПлановыеЗатратыНоменклатура.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	ПлановыеЗатратыНоменклатура.Номенклатура КАК Номенклатура,
	|	ПлановыеЗатратыНоменклатура.КоличествоПлан КАК КоличествоПлан,
	|	ПлановыеЗатратыНоменклатура.ДокументПлана КАК ДокументПлана,
	|	ПлановыеЗатратыНоменклатура.ВидЗатрат КАК ВидЗатрат,
	|	ПлановыеЗатратыНоменклатура.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ПлановыеЗатраты
	|ИЗ
	|	ПланЗатратыНом_Приоритет КАК вт_НомПриоритет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеЗатратыНоменклатура КАК ПлановыеЗатратыНоменклатура
	|		ПО вт_НомПриоритет.ID = ПлановыеЗатратыНоменклатура.ID
	|			И вт_НомПриоритет.Приоритет = ПлановыеЗатратыНоменклатура.Приоритет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РемонтыМероприятийсКоличеством.ОбъектРемонта,
	|	РемонтыМероприятийсКоличеством.ВидРемонтныхРабот,
	|	РемонтыМероприятийсКоличеством.ID,
	|	РемонтыМероприятийсКоличеством.ДокументВводаРемонта,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура,
	|	СУММА(РемонтыМероприятийсКоличеством.Количество * торо_ТехКартыМатериальныеЗатраты.Количество),
	|	РемонтыМероприятийсКоличеством.ДокументВводаРемонта,
	|	""Материальные затраты"",
	|	торо_ТехКартыМатериальныеЗатраты.Характеристика
	|ИЗ
	|	РемонтыМероприятийсКоличеством КАК РемонтыМероприятийсКоличеством
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	|		ПО РемонтыМероприятийсКоличеством.ТехКарта = торо_ТехКартыМатериальныеЗатраты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РемонтыМероприятийсКоличеством.ОбъектРемонта,
	|	РемонтыМероприятийсКоличеством.ВидРемонтныхРабот,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура,
	|	торо_ТехКартыМатериальныеЗатраты.Характеристика,
	|	РемонтыМероприятийсКоличеством.ID,
	|	РемонтыМероприятийсКоличеством.ДокументВводаРемонта,
	|	РемонтыМероприятийсКоличеством.ДокументВводаРемонта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлановыеЗатратыЗапчастей.ОбъектРемонта,
	|	ПлановыеЗатратыЗапчастей.ВидРемонта,
	|	ПлановыеЗатратыЗапчастей.ID,
	|	ПлановыеЗатратыЗапчастей.ДокументВводаРемонта,
	|	ПлановыеЗатратыЗапчастей.Номенклатура,
	|	ПлановыеЗатратыЗапчастей.КоличествоПлан,
	|	ПлановыеЗатратыЗапчастей.ДокументПлана,
	|	ПлановыеЗатратыЗапчастей.ВидЗатрат,
	|	ПлановыеЗатратыЗапчастей.Характеристика
	|ИЗ
	|	ПланЗатратыЗапчастей_Приоритет КАК вт_ЗапчастиПриоритет
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеЗатратыЗапчастей КАК ПлановыеЗатратыЗапчастей
	|		ПО вт_ЗапчастиПриоритет.ID = ПлановыеЗатратыЗапчастей.ID
	|			И вт_ЗапчастиПриоритет.Приоритет = ПлановыеЗатратыЗапчастей.Приоритет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Номенклатура,
	|	ОбъектРемонта,
	|	ДокументПлана
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	торо_РемонтыПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_РемонтыПлан.ВидРемонта КАК ВидРемонта,
	|	торо_РемонтыПлан.ID КАК ID,
	|	торо_РемонтыПлан.ДокументПлана КАК ДокументПлана,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.Номенклатура КАК Номенклатура,
	|	""Материальные затраты"" КАК ВидЗатрат,
	|	торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.ХарактеристикаНоменклатуры КАК Характеристика
	|ПОМЕСТИТЬ ФактическиеЗатраты
	|ИЗ
	|	торо_РемонтыПлан КАК торо_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ФактическиеМатериальныеЗатратыРемонтныхРабот КАК торо_ФактическиеМатериальныеЗатратыРемонтныхРабот
	|		ПО торо_РемонтыПлан.ID = торо_ФактическиеМатериальныеЗатратыРемонтныхРабот.РемонтыОборудования_ID
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_РемонтыПлан.ОбъектРемонта,
	|	торо_РемонтыПлан.ВидРемонта,
	|	торо_РемонтыПлан.ID,
	|	торо_РемонтыПлан.ДокументПлана,
	|	торо_ФактическиеЗатратыЗапчастей.Номенклатура,
	|	""Затраты запчастей"",
	|	торо_ФактическиеЗатратыЗапчастей.ХарактеристикаНоменклатуры
	|ИЗ
	|	торо_РемонтыПлан КАК торо_РемонтыПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.торо_ФактическиеЗатратыЗапчастей КАК торо_ФактическиеЗатратыЗапчастей
	|		ПО торо_РемонтыПлан.ID = торо_ФактическиеЗатратыЗапчастей.РемонтыОборудования_ID
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Номенклатура,
	|	ОбъектРемонта,
	|	ДокументПлана
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Торо_РемонтыПлан.ID КАК РЕмонтыОборудования_ID,
	|	Торо_РемонтыПлан.ДокументВводаРемонта КАК ДокументВводаРемонта,
	|	ЕСТЬNULL(ПлановыеЗатраты.Номенклатура, ФактическиеЗатраты.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ПлановыеЗатраты.КоличествоПлан, 0) КАК ПлановоеКоличество,
	|	ЕСТЬNULL(ЕСТЬNULL(ПлановыеЗатраты.ДокументПлана, ФактическиеЗатраты.ДокументПлана), Торо_РемонтыПлан.ДокументВводаРемонта) КАК ДокументПлана,
	|	ВЫБОР
	|		КОГДА ПлановыеЗатраты.ДокументПлана ЕСТЬ NULL
	|			ТОГДА Торо_РемонтыПлан.ДокументВводаРемонта.Дата
	|		ИНАЧЕ ПлановыеЗатраты.ДокументПлана.Дата
	|	КОНЕЦ КАК ПлановыйПериод,
	|	ЕСТЬNULL(ПлановыеЗатраты.ВидЗатрат, ФактическиеЗатраты.ВидЗатрат) КАК ВидЗатрат,
	|	Торо_РемонтыПлан.ОбъектРемонта КАК ОбъектРемонта,
	|	Торо_РемонтыПлан.ВидРемонта КАК ВидРемонта,
	|	Торо_РемонтыПлан.ДатаНачалаПлан КАК ДатаНачалаПлан,
	|	Торо_РемонтыПлан.ВидДокумента КАК ВидДокумента,
	|	ЕСТЬNULL(ПлановыеЗатраты.Характеристика, ФактическиеЗатраты.Характеристика) КАК Характеристика
	|ПОМЕСТИТЬ ЗатратыПланФакт
	|ИЗ
	|	торо_РемонтыПлан КАК Торо_РемонтыПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПлановыеЗатраты КАК ПлановыеЗатраты
	|			ПОЛНОЕ СОЕДИНЕНИЕ ФактическиеЗатраты КАК ФактическиеЗатраты
	|			ПО ПлановыеЗатраты.ID = ФактическиеЗатраты.ID
	|				И ПлановыеЗатраты.Номенклатура = ФактическиеЗатраты.Номенклатура
	|				И ПлановыеЗатраты.Характеристика = ФактическиеЗатраты.Характеристика
	|				И ПлановыеЗатраты.ВидЗатрат = ФактическиеЗатраты.ВидЗатрат
	|				И ПлановыеЗатраты.ОбъектРемонта = ФактическиеЗатраты.ОбъектРемонта
	|				И ПлановыеЗатраты.ДокументПлана = ФактическиеЗатраты.ДокументПлана
	|		ПО (ЕСТЬNULL(ПлановыеЗатраты.ID, ФактическиеЗатраты.ID) = Торо_РемонтыПлан.ID)
	|			И (ЕСТЬNULL(ПлановыеЗатраты.ДокументПлана, ФактическиеЗатраты.ДокументПлана) = Торо_РемонтыПлан.ДокументПлана)
	|ГДЕ
	|	НЕ ЕСТЬNULL(ПлановыеЗатраты.Номенклатура, ФактическиеЗатраты.Номенклатура) ЕСТЬ NULL
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика,
	|	ОбъектРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ЦеныНоменклатуры.Период) КАК ПлановыйПериод,
	|	ЗатратыПланФакт.РЕмонтыОборудования_ID КАК РЕмонтыОборудования_ID,
	|	ЗатратыПланФакт.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЗатратыПланФакт.Номенклатура КАК Номенклатура,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта КАК торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	ЗатратыПланФакт.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ПлановыйФактическиеПериодыИзРегистра
	|ИЗ
	|	ЗатратыПланФакт КАК ЗатратыПланФакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ЗатратыПланФакт.ДатаНачалаПлан >= ЦеныНоменклатуры.Период
	|			И ЗатратыПланФакт.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ЗатратыПланФакт.Номенклатура.ЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыПланФакт.РЕмонтыОборудования_ID,
	|	ЗатратыПланФакт.Номенклатура.ЕдиницаИзмерения,
	|	ЗатратыПланФакт.Номенклатура,
	|	Константы.торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	ЗатратыПланФакт.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЕдиницаИзмерения,
	|	торо_ТипЦеныДляРасчетаСебестоимостиРемонта,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК ПлановаяЦена,
	|	ПлановыйФактическиеПериодыИзРегистра.РЕмонтыОборудования_ID КАК РЕмонтыОборудования_ID,
	|	ПлановыйФактическиеПериодыИзРегистра.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатуры.Валюта КАК ВалютаПлан,
	|	ПлановыйФактическиеПериодыИзРегистра.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ЦенаПланФакт
	|ИЗ
	|	ПлановыйФактическиеПериодыИзРегистра КАК ПлановыйФактическиеПериодыИзРегистра
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО ПлановыйФактическиеПериодыИзРегистра.ПлановыйПериод = ЦеныНоменклатуры.Период
	|			И ПлановыйФактическиеПериодыИзРегистра.ЕдиницаИзмерения = ЦеныНоменклатуры.ЕдиницаИзмерения
	|			И ПлановыйФактическиеПериодыИзРегистра.торо_ТипЦеныДляРасчетаСебестоимостиРемонта = ЦеныНоменклатуры.ВидЦены
	|			И ПлановыйФактическиеПериодыИзРегистра.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|			И ПлановыйФактическиеПериодыИзРегистра.Характеристика = ЦеныНоменклатуры.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РЕмонтыОборудования_ID,
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗатратыПланФакт.Номенклатура КАК Номенклатура,
	|	ЗатратыПланФакт.РЕмонтыОборудования_ID КАК РемонтыОборудования_IDНоменклатура,
	|	ЕСТЬNULL(торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта, ЗатратыПланФакт.ОбъектРемонта) КАК ОбъектРемонтаНоменклатура,
	|	ЗатратыПланФакт.ВидРемонта КАК ВидРемонтаНоменклатура,
	|	ЗатратыПланФакт.ДокументПлана КАК ДокументПлана,
	|	МАКСИМУМ(ЗатратыПланФакт.ДатаНачалаПлан) КАК ДатаНачалаПланНоменклатура,
	|	СУММА(ЗатратыПланФакт.ПлановоеКоличество) КАК ПлановоеКоличествоНоменклатура,
	|	СРЕДНЕЕ(ЦенаПланФакт.ПлановаяЦена) КАК ПлановаяЦенаНоменклатура,
	|	СУММА(ЗатратыПланФакт.ПлановоеКоличество * ЦенаПланФакт.ПлановаяЦена) КАК ПлановаяСуммаНоменклатура,
	|	ЗатратыПланФакт.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияНоменклатура,
	|	ЗатратыПланФакт.ВидЗатрат КАК ВидЗатратНоменклатура,
	|	ЗатратыПланФакт.ВидДокумента КАК ВидДокументаНоменклатура,
	|	ЦенаПланФакт.ВалютаПлан КАК ВалютаПлан,
	|	ЗатратыПланФакт.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ЗатратыБезУчетаВалюты
	|ИЗ
	|	ЗатратыПланФакт КАК ЗатратыПланФакт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаПланФакт КАК ЦенаПланФакт
	|		ПО ЗатратыПланФакт.РЕмонтыОборудования_ID = ЦенаПланФакт.РЕмонтыОборудования_ID
	|			И ЗатратыПланФакт.Номенклатура = ЦенаПланФакт.Номенклатура
	|			И ЗатратыПланФакт.Характеристика = ЦенаПланФакт.Характеристика
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_МаршрутыРегламентныхМероприятий КАК торо_МаршрутыРегламентныхМероприятий
	|		ПО ЗатратыПланФакт.ОбъектРемонта = торо_МаршрутыРегламентныхМероприятий.СписокОбъектов
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыПланФакт.Номенклатура,
	|	ЗатратыПланФакт.РЕмонтыОборудования_ID,
	|	ЕСТЬNULL(торо_МаршрутыРегламентныхМероприятий.ОбъектРемонта, ЗатратыПланФакт.ОбъектРемонта),
	|	ЗатратыПланФакт.ВидРемонта,
	|	ЗатратыПланФакт.ДокументПлана,
	|	ЗатратыПланФакт.Номенклатура.ЕдиницаИзмерения,
	|	ЗатратыПланФакт.ВидЗатрат,
	|	ЗатратыПланФакт.ВидДокумента,
	|	ЦенаПланФакт.ВалютаПлан,
	|	ЗатратыПланФакт.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВалютаПлан,
	|	Номенклатура,
	|	РемонтыОборудования_IDНоменклатура,
	|	ОбъектРемонтаНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗатратыБезУчетаВалюты.РемонтыОборудования_IDНоменклатура КАК РемонтыОборудования_IDНоменклатура,
	|	ЗатратыБезУчетаВалюты.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(КурсыВалют.Период) КАК ПериодПланРег,
	|	КурсыВалют.Валюта КАК ВалютаПлан,
	|	ЗатратыБезУчетаВалюты.ДатаНачалаПланНоменклатура КАК ДатаНачалаПланНоменклатура
	|ПОМЕСТИТЬ ПериодыВалюты
	|ИЗ
	|	ЗатратыБезУчетаВалюты КАК ЗатратыБезУчетаВалюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ЗатратыБезУчетаВалюты.ДатаНачалаПланНоменклатура >= КурсыВалют.Период
	|			И ЗатратыБезУчетаВалюты.ВалютаПлан = КурсыВалют.Валюта
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗатратыБезУчетаВалюты.Номенклатура,
	|	ЗатратыБезУчетаВалюты.РемонтыОборудования_IDНоменклатура,
	|	КурсыВалют.Валюта,
	|	ЗатратыБезУчетаВалюты.ДатаНачалаПланНоменклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВалютаПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПериодыВалюты.РемонтыОборудования_IDНоменклатура КАК РемонтыОборудования_IDНоменклатура,
	|	ПериодыВалюты.Номенклатура КАК Номенклатура,
	|	ПериодыВалюты.ВалютаПлан КАК ВалютаПлан,
	|	ЕСТЬNULL(КурсыВалют.Курс, 1) КАК КурсПлан,
	|	ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК КратностьПлан,
	|	ПериодыВалюты.ДатаНачалаПланНоменклатура КАК ДатаНачалаПланНоменклатура
	|ПОМЕСТИТЬ КурсыВалюты
	|ИЗ
	|	ПериодыВалюты КАК ПериодыВалюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО ПериодыВалюты.ПериодПланРег = КурсыВалют.Период
	|			И ПериодыВалюты.ВалютаПлан = КурсыВалют.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	РемонтыОборудования_IDНоменклатура,
	|	ВалютаПлан
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗатратыБезУчетаВалюты.Номенклатура КАК Номенклатура,
	|	ЗатратыБезУчетаВалюты.РемонтыОборудования_IDНоменклатура КАК РемонтыОборудования_IDНоменклатура,
	|	ЗатратыБезУчетаВалюты.ОбъектРемонтаНоменклатура КАК ОбъектРемонтаНоменклатура,
	|	ЗатратыБезУчетаВалюты.ВидРемонтаНоменклатура КАК ВидРемонтаНоменклатура,
	|	ЗатратыБезУчетаВалюты.ДокументПлана КАК ДокументПлана,
	|	ЗатратыБезУчетаВалюты.ДатаНачалаПланНоменклатура КАК ДатаНачалаПланНоменклатура,
	|	ЗатратыБезУчетаВалюты.ПлановоеКоличествоНоменклатура КАК ПлановоеКоличествоНоменклатура,
	|	ЗатратыБезУчетаВалюты.ПлановаяЦенаНоменклатура КАК ПлановаяЦенаНоменклатура,
	|	ЗатратыБезУчетаВалюты.ПлановаяСуммаНоменклатура * КурсыВалюты.КурсПлан / КурсыВалюты.КратностьПлан КАК ПлановаяСуммаНоменклатура,
	|	ЗатратыБезУчетаВалюты.ЕдиницаИзмеренияНоменклатура КАК ЕдиницаИзмеренияНоменклатура,
	|	ЗатратыБезУчетаВалюты.ВидЗатратНоменклатура КАК ВидЗатратНоменклатура,
	|	ЗатратыБезУчетаВалюты.ВидДокументаНоменклатура КАК ВидДокументаНоменклатура,
	|	КурсыВалюты.ВалютаПлан КАК ВалютаПлан,
	|	ЗатратыБезУчетаВалюты.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ СНулевымиЗначениями
	|ИЗ
	|	ЗатратыБезУчетаВалюты КАК ЗатратыБезУчетаВалюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалюты КАК КурсыВалюты
	|		ПО ЗатратыБезУчетаВалюты.Номенклатура = КурсыВалюты.Номенклатура
	|			И ЗатратыБезУчетаВалюты.РемонтыОборудования_IDНоменклатура = КурсыВалюты.РемонтыОборудования_IDНоменклатура
	|			И ЗатратыБезУчетаВалюты.ДатаНачалаПланНоменклатура = КурсыВалюты.ДатаНачалаПланНоменклатура
	|			И ЗатратыБезУчетаВалюты.ВалютаПлан = КурсыВалюты.ВалютаПлан
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|		ПО ЗатратыБезУчетаВалюты.ОбъектРемонтаНоменклатура = торо_ОбъектыРемонта.Ссылка"
	
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
	ЗапросТекст = дс_ДобавитьПараметрыВТекстЗапроса(ЗапросТекст);
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
	Возврат ЗапросТекст;
	
КонецФункции
	
// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
#Область Локализация

Функция дс_ДобавитьПараметрыВТекстЗапроса(ТекстЗапроса)
	СтрокиЗамены = Новый Соответствие;

	СтрокиЗамены.Вставить("""План-график ремонта""", 		"&ПланГрафикРемонта");
	СтрокиЗамены.Вставить("""Материальные затраты""", 		"&МатериальныеЗатраты");
	СтрокиЗамены.Вставить("""Выявленные дефекты""", 		"&ВыявленныеДефекты");
	СтрокиЗамены.Вставить("""Внешние основания""", 			"&ВнешниеОснования");
	СтрокиЗамены.Вставить("""Регламентные мероприятия""", 	"&РегламентныеМероприятия");
	СтрокиЗамены.Вставить("""Затраты запчастей""", 			"&ЗатратыЗапчастей");

	Для каждого КодЗамены Из СтрокиЗамены Цикл
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
	КонецЦикла;
	
	Возврат ТекстЗапроса;
КонецФункции
 
Процедура дс_ДобавитьПараметрыВСКД()
	Переводы = Новый Соответствие;
	
	Переводы.Вставить("ПланГрафикРемонта", 			НСтр("es='Horario de reparación';ru='План-график ремонта';en='Repair plan-schedule'"));
	Переводы.Вставить("МатериальныеЗатраты", 		НСтр("es='Los costos de los materiales';ru='Материальные затраты';en='Material costs'"));
	Переводы.Вставить("ВыявленныеДефекты", 			НСтр("es='Los defectos identificados';ru='Выявленные дефекты';en='Defects Identified'"));
	Переводы.Вставить("ВнешниеОснования", 			НСтр("es='Externos de la fundación';ru='Внешние основания';en='External bases'"));
	Переводы.Вставить("РегламентныеМероприятия", 	НСтр("es='Actividades de mantenimiento rutinario';ru='Регламентные мероприятия';en='Regulatory activities'"));
	Переводы.Вставить("ЗатратыЗапчастей", 			НСтр("es='El costo de las partes de recambio';ru='Затраты запчастей';en='The cost of spare parts'"));
	
	Для каждого Перевод Из Переводы Цикл
		Если СхемаКомпоновкиДанных.Параметры.Найти(Перевод.Ключ) = Неопределено Тогда
			НовыйПараметр = СхемаКомпоновкиДанных.Параметры.Добавить();
			НовыйПараметр.Имя 			= Перевод.Ключ;
			НовыйПараметр.Значение 		= Перевод.Значение;
			НовыйПараметр.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
			НовыйПараметр.ОграничениеИспользования = Истина;
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти 
// << [Деснол] [Ушаков А.Д.] [04.10.2019] 

#КонецОбласти

#КонецЕсли
